# BuiltInFailures.SubRegionFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SubRegionFailures Class
BuiltInFailures Class Members See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SubRegionFailures
```

Visual Basic
---
```text
Public NotInheritable Class SubRegionFailures
```

Visual C++
---
```text
public ref class SubRegionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SubRegionFailures
# See Also
BuiltInFailures..::..SubRegionFailures Members
Autodesk.Revit.DB Namespace